Repository: SoftlineDevGroup/RequestLog
Catalog: sline.IntegrationCore/sline.IntegrationCore.Shared/OutRequest/OutRequestSystem.*.resx
Languages: ru

# Property_Answer
source: Server answer
ru: Ответ сервера

# DisplayName
source: Outgoing request
ru: Исходящий запрос

# AccusativeDisplayName
source: Outgoing request
ru: Исходящий запрос

# CollectionDisplayName
source: Outgoing requests
ru: Исходящие запросы

# Property_IsSend
source: Is send
ru: Отправлен

# Property_SendDatetime
source: Send datetime
ru: Дата отправки

# Property_IsDelivery
source: Is delivery
ru: Доставлен

# Property_DeliveryDatetime
source: Delivery datetime
ru: Дата доставки

# Property_Body
source: Body
ru: Тело запроса

# Property_SendTo
source: Receiver system
ru: Система-получатель

# Action_Resend
source: Resend
ru: Отправить повторно

# Action_ResendHint
source: Resend
ru: Отправить повторно

# Action_ResendDescription
source: Resend query
ru: Отправить запрос повторно

# Property_Method
source: Method
ru: Метод

# Property_MethodType
source: Method type
ru: Тип метода

# Property_Auth
source: Auth
ru: Аутентификация

# Property_Headers
source: Headers
ru: Заголовки

# ControlGroup_11ab2d7fdf4f4bb48249b2c205d9b46c
source: Headers
ru: Заголовки

# Property_Answers
source: Answers from other systems
ru: Ответы от других систем

# Property_InstantResponse
source: Instant response
ru: Моментальный ответ

# Property_EntityType
source: Entity type
ru: Тип сущности

# Property_EntityId
source: Entity Id
ru: ИД сущности

# Property_Name
source: Name
ru: Имя

# Enum_Status_Completed
source: Completed
ru: Выполненая

# Property_Iteration
source: Iteration
ru: Итерация

# Property_AsyncHandlerId
source: Async Handler Id
ru: Guid АО

# Enum_Status_InWork
source: In work
ru: В работе

# Property_StatusCode
source: Status code
ru: Код состояния
