Repository: SoftlineDevGroup/RequestLog
Catalog: sline.IntegrationCore/sline.IntegrationCore.Shared/ModuleSystem.*.resx
Languages: ru

# DisplayName
source: Integration
ru: Интеграция

# JobDisplayName_49331c4395434e9587272ebcf2781de1
source: Integration. Sending requests
ru: Интеграция. Отправка запросов

# JobDescription_49331c4395434e9587272ebcf2781de1
source: Sending requests to external system
ru: Отправка запросов к сторонней системе

# AsyncHandler_Description_bb7c9c61e9124115b060c19728a72353
source: Send query to external system
ru: Отправка запроса к внешней системе

# CoverGroup_MainGroup
source: Main
ru: Основное

# CoverGroup_Settings
source: Settings
ru: Настройки

# CoverAction_ShowIntegrationSettings
source: Integration module settings
ru: Настройки модуля интеграции

# CoverTitle
source: Module for integration with external systems
ru: Модуль интеграции с внешними системами

# CoverAction_OutgoingRequests
source: Outgoing requests
ru: Исходящие запросы

# CoverAction_IncomingRequests
source: Incoming requests
ru: Входящие запросы

# CoverDescription_IncomingRequests
source: The log contains all incoming messages from third-party systems
ru: Журнал содержит все входящие сообщения из сторонних систем

# CoverDescription_OutgoingRequests
source: The log contains all outgoing messages to third-party systems
ru: Журнал содержит все исходящие сообщения к сторонним системам

# CoverDescription_ShowIntegrationSettings
source: A lot of parameters for performing operations
ru: Ряд параметров для выполнения операций модуля интеграции со сторонними системами

# CoverDescription
source: The module is designed to work with integration messages in any direction.
ru: Модуль предназначен для работы с интеграционными сообщениями в любом направлении.

# CoverAction_ExternalConnection
source: Connections
ru: Подключения

# CoverDescription_ExternalConnection
source: The databook contains authentication information for connecting to third-party systems.
ru: Справочник содержит аутентификационную информацию для подключения к сторонним системам

# JobDisplayName_0616564999694e9a9946dc9d86e710f6
source: Integration. Delete old requests
ru: Интеграция. Очистка старых запросов

# JobDescription_0616564999694e9a9946dc9d86e710f6
source: Cleaning up stale requests
ru: Очистка устаревших запросов
