Repository: SoftlineDevGroup/RequestLog
Catalog: sline.IntegrationCore/sline.IntegrationCore.Shared/Module.*.resx
Languages: ru

# RoleNameIntegration
source: Responsible for integration
ru: Ответственные за интеграцию

# DescriptionIntegration
source: Users responsible for integration with external systems.
ru: Пользователи, ответственные за интеграцию с внешними системами.

source: Password
ru: Пароль

source: Set password
ru: Задать пароль

# CheckingConnection
source: Checking the connection
ru: Проверка подключения

# ErrorNotFoundIteration
source: The integration setting "Number of iterations" is missing in the database
ru: Отсутствует настройка интеграции "Количество итераций" в базе данных

# ErrorNotFoundBatch
source: The integration setting "Package size" is missing in the database
ru: Отсутствует настройка интеграции "Размер пакета" в базе данных

# SettingDialogName
source: Integration settings
ru: Настройки модуля интеграции

# SettingDialogJob
source: Job "Integration. Sending requests"
ru: ФП "Интеграция. Отправка запросов"

# SettingDialogInterationName
source: Submission iterations count
ru: Количество итераций отправки

# SettingDialogBatchName
source: Package size
ru: Размер пакета

# SettingDialogDocumentsName
source: Documents count
ru: Количество документов

# SettingDialogDebug
source: Debug mode
ru: Режим отладки

# SettingDialogBoolean
source: Enabled
ru: Включено

# SettingDialogButtonUpdate
source: Set values
ru: Задать значения

# Person_PropsNotSpecified
source: It was not possible to synchronize the person with ID '{0}', ExtId '{1}', because the TIN or INILA was not specified in the external system
ru: Не удалось синхронизировать персону (ID '{0}', ExtId '{1}'), так как во внешней системе не указан ИНН или СНИЛС

# Person_ManyEntitiesFound
source: Failed to sync person with ID '{0}', ExtId '{1}'. Several persons with the specified TIN and/or INILA were found in Directum RX
ru: Не удалось синхронизировать персону c ID '{0}', ExtId '{1}'. В Directum RX найдено несколько персон с указанными ИНН и/или СНИЛС

# Person_NotCompleted
source: Failed to create or sync person with ID '{0}', ExtId '{1}'
ru: Не удалось создать или синхронизировать персону c ID '{0}', ExtId '{1}'

# Entity_ValidationError
source: Validation errors when saving an entity with ID '{0}', ExtId '{1}': {2}
ru: Ошибки валидации при сохранении сущности с ID '{0}', ExtId '{1}': {2}

# Entity_SaveError
source: Failed to save entity with ID '{0}', ExtId '{1}' due to reason '{2}'
ru: Не удалось сохранить сущность с ID '{0}', ExtId '{1}' по причине '{2}'

# ExtLink_SaveError
source: Failed to save external link for entity with ID '{0}', ExtId '{1}' due to reason '{2}'
ru: Не удалось сохранить внешнюю ссылку для сущности с ID '{0}', ExtId '{1}' по причине '{2}'

# Employee_PersonNotFound
source: Person with ID '{0}', ExtId '{1}' was not found for employee with ID '{2}', ExtId '{3}'
ru: Не найдена персона с ID '{0}', ExtId '{1}' для сотрудника с ID '{2}', ExtId '{3}'

# Employee_DepartmentNotFound
source: Department with ID '{0}', ExtId '{1}' was not found for employee with ID '{2}', ExtId '{3}'
ru: Не найдено подразделение c ID '{0}', ExtId '{1}' для сотрудника c ID '{2}', ExtId '{3}'

# JobTitle_DepartmentNotFound
source: Department with ID '{0}', ExtId '{1}' was not found for job title with ID '{2}', ExtId '{3}'
ru: Не найдено подразделение с ID '{0}', ExtId '{1}' для должности c ID '{2}', ExtId '{3}'

# Departments_HeadNotFound
source: The parent department with ID '{0}', ExtId '{1}' was not found for the department with ID '{2}', ExtId '{3}'
ru: Не найдено вышестоящее подразделение с ID '{0}', ExtId '{1}' для подразделения c ID '{2}', ExtId '{3}'

# Department_BusinessUnitNotFound
source: Business unit with ID '{0}', ExtId '{1}' was not found for department with ID '{2}', ExtId '{3}'
ru: Не найдена НОР с ID '{0}', ExtId '{1}' для подразделения c ID '{2}', ExtId '{3}'

# Department_ManagerNotFound
source: Manager with ID '{0}', ExtId '{1}' was not found for department with ID '{2}', ExtId '{3}'
ru: Не найден руководитель с ID '{0}', ExtId '{1}' для подразделения c ID '{2}', ExtId '{3}'

# BusinessUnit_CEONotFound
source: Manager with ID '{0}', ExtId '{1}' was not found for business unit with ID '{2}', ExtId '{3}'
ru: Не найден руководитель с ID '{0}', ExtId '{1}' для НОР c ID '{2}', ExtId '{3}'

# BusinessUnit_HeadCompanyNotFound
source: The parent organization with ID '{0}', ExtId '{1}' was not found for business unit with ID '{2}', ExtId '{3}'
ru: Не найдена вышестоящая организация c ID '{0}', ExtId '{1}' для НОР c ID '{2}', ExtId '{3}'

# Employee_JobTitleNotFound
source: Job title with ExtId '{0}' was not found for employee with ID '{1}', ExtId '{2}'
ru: Не найдена должность с ExtId '{0}' для сотрудника c ID '{1}', ExtId '{2}'

# SettingDialogIncRequests
source: Capture incoming requests
ru: Фиксировать входящие запросы

# IncRequest_Name
source: Synchronize entity "{0}" from {1}
ru: Синхронизация сущности "{0}" от {1}

# OutRequest_NullReqValues
source: Error: required values is null or empty.
ru: Ошибка: обязательные параметры не заполнены.

# OutRequest_EntityNotFound
source: Not found OutRequest with Id '{0}'.
ru: Не найден исходящий запрос с ID '{0}'

# OutRequest_Exception
source: Error: Check Directum RX logs to view full information about exception.
ru: Ошибка: проверьте логи Directum RX для полной информации об исключении.

# OutRequest_OK
source: Success
ru: Успешно

# ExternalSystemNotSpecified
source: Recipient system not specified
ru: Не указана система-получатель

# OutRequest_WebExceptionNoResponse
source: WebException. Error: {0}
ru: WebException. Ошибка: {0}

# OutRequest_OtherException
source: Other exception. {0}
ru: Необработанное исключение. {0}

# Counterparty_RequiredFieldsError
source: Required fields not filled: {0}
ru: Не заполнены обязательные поля: {0}

# Setting_NoRights
source: You can't work with module settings
ru: Вы не можете работать с настройками модуля

# SettingDialogADUse
source: Use AD integration module
ru: Использовать модуль интеграции с AD

# Dialog_No
source: No
ru: Нет

# Dialog_Yes
source: Yes
ru: Да

# Counterparty_ResponsibleNotFound
source: Not found responsible employee with ID '{0}', ExtId '{1}' for counterparty with ID '{2}', ExtId '{3}'
ru: Не найден ответственный сотрудник с ID '{0}', ExtId '{1}' для контрагента c ID '{2}', ExtId '{3}'

# GroupGeneral
source: General
ru: Общее

# IncomingGroup
source: Incoming flow
ru: Входящий поток

# OutgoingGroup
source: Outgoing flow
ru: Исходящий поток

# SettingDialogLifeTime
source: Requests life time (days)
ru: Хранить запросы (в днях)

# Counterparty_HeadCompanyNotFound
source: Not found head company with ID '{0}', ExtId '{1}' for counterparty with ID '{2}', ExtId '{3}'
ru: Не найдена головная организация с ID '{0}', ExtId '{1}' для контрагента c ID '{2}', ExtId '{3}

# BusinessUnitName
source: Business unit
ru: Наша организация

# DepartmentName
source: Department
ru: Подразделение

# PersonName
source: Person
ru: Персона

# UpdateOutRequestName
source: Sending a response from an external system to a request with the ID "{0}" from {1}
ru: Передача ответа от сторонней системы по запросу с ID "{0}" от {1}
